// Твоя задача реализовать полноостью рабочий хедер
// Слева должен быть логотип приложения
// Справа если пользователь авторизован, то должен быть ссылка на страницу пользователя
// То есть дожна быть МОКОВАЯ аватарка и его имя. При нажатии на кнопку пользователь должен перейти на страницу пользователя
// Чуть левее иконка уведомлений
// А потом уже идут сообщения и группы (текстом)
// Логотим перекидывает на стринцу рекомендаций
// Если пользователь не авторизован, то должна быть ссылка на страницу регистрации
// Асболлютно все кнопки кликабельны
// Цвет тот самый темный, что был в примере homePage
// ДЕДЛАЙН: ВЕЧЕР ВТОРНКА
//
// если что везде хедер будет одинаковый
